load-test.yml
config:
  target: "https://cs4552048game-production.up.railway.app"
  phases:
    - duration: 30  
      arrivalRate: 167 
      rampTo: 10000    
scenarios:
  - name: Get leaderboard scenario
    flow:
      - get:
          url: '/api/get-leaderboard'
  - name: Save score scenario
    flow:
      - post:
          url: '/api/save-score'
          json:
            playerName: 'TestUser'
            score: 100